{
    "instructions": {
    "pl_PL": "1. Pliki wejściowe powinny się znaleźć w folderze 'in', natomiast pliki z oczekiwanym wyjściem w folderze 'out. W folderach zawsze powinna się znaleźć równa liczba plików.\n\n2. Nazwy odpowiednich plików wejściowych i wyjściowych powinny się różnić tylko dopiskiem 'in' i 'out' w ich nazwach lub w ogóle się nie różnić.\n\n3. Poszczególne przypadki testowe powinny być oddzielone pustą linią w plikach z danymi wejściowymi, jak i w plikach z oczekiwanym wyjściem.\n\n4. Pliki wynikowe pojawiają się w folderze 'results'. Ich nazwy będą tworzone z części nazwy pliku wejściowego oraz czasu początku uruchomienia testów.\n\n5. Przypadki testowe będą numerowane od 1, chyba że w pliku wejściowym przed każdym przypadkiem testowym znajdzie się dopisek %name: nameOfTestCase%. W nazwach przypadków testowych dozwolone są tylko litery oraz liczby.\n\n\nKliknij 'Tak' jeżeli Twoje pliki są przygotowane zgodnie z powyższymi wytycznymi, w przeciwnym wypadku kliknij 'Nie'.",
    "en_EN": "1. Input files should be in the 'in' folder, while files with expected output should be in the 'out' folder. The folders should always contain an equal number of files. The names of the corresponding input and output files should differ only by the addition of 'in' and 'out' in their names, or not at all. Individual test cases should be separated by a blank line in the input files as well as in the files with the expected output.The test cases should be separated by a blank line. The result files appear in the 'results' folder. Their names will be created from a portion of the input file name and the start time of the test run.The test cases will be numbered. Test cases will be numbered starting from 1, unless the %name: nameOfTestCase% is appended before each test case in the input file. Only letters and numbers are allowed in test case names.Click 'Yes' if your files are prepared according to the above guidelines, otherwise click 'No'.",
    "uk_UA": "1. вхідні файли мають бути у теці 'in', а файли з очікуваним виходом - у теці 'out'. Теки завжди повинні містити однакову кількість файлів.\n\n2. Назви відповідних вхідних та вихідних файлів повинні відрізнятися лише додаванням 'in' та 'out' або не відрізнятися взагалі.\n\n3. Окремі тестові випадки повинні бути відокремлені порожнім рядком як у вхідних, так і в очікуваних вихідних файлах.\n\n4. Файли результатів з'являються у папці 'results'. Їх імена будуть створені з частини імені вхідного файлу та часу запуску тесту.\n\n5. Тести будуть пронумеровані. Нумерація тестів починається з 1, якщо у вхідному файлі перед кожним тестом не вказано %name: nameOfTestCase%. У назвах тестових кейсів дозволено використовувати лише літери та цифри.\n\n\nНатисніть 'Tak', якщо ваші файли підготовлено відповідно до наведених вище інструкцій, інакше натисніть 'Hi'."
    },
    "error_word": {
        "pl_PL": "Błąd",
        "en_EN": "Error",
        "uk_UA": "помилка"
    }
}